MyLoveJayChou/HC32L19x_BASE_PROJECT_BY_FREERTOS/Core/Inc/FreeRTOSConfig.h
/*
 * FreeRTOS configuration for HC32L19x / Cortex-M0+ / 48MHz
 */

#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#include "hc32l19x.h"

#define configUSE_PREEMPTION                     1
#define configUSE_IDLE_HOOK                      0
#define configUSE_TICK_HOOK                      0
#define configCPU_CLOCK_HZ                       ( ( unsigned long ) 48000000UL )
#define configTICK_RATE_HZ                       ( ( TickType_t ) 1000 )
#define configMAX_PRIORITIES                     32
#define configMINIMAL_STACK_SIZE                 ( ( unsigned short ) 128 )
#define configTOTAL_HEAP_SIZE                    ( ( size_t ) ( 20 * 1024 ) )
#define configMAX_TASK_NAME_LEN                  16
#define configUSE_TRACE_FACILITY                 1
#define configUSE_STATS_FORMATTING_FUNCTIONS     1
#define configTICK_TYPE_WIDTH_IN_BITS            TICK_TYPE_WIDTH_32_BITS
#define configIDLE_SHOULD_YIELD                  1

#define configUSE_CO_ROUTINES                    0
#define configMAX_CO_ROUTINE_PRIORITIES          2

#define configSUPPORT_DYNAMIC_ALLOCATION         1
#define configSUPPORT_STATIC_ALLOCATION          0
#define configUSE_MUTEXES                        1
#define configUSE_RECURSIVE_MUTEXES              1
#define configUSE_COUNTING_SEMAPHORES            1
#define configUSE_QUEUE_SETS                     1
#define configUSE_TIMERS                         0
#define configUSE_PORT_OPTIMISED_TASK_SELECTION  0

#define configCHECK_FOR_STACK_OVERFLOW           0
#define configUSE_MALLOC_FAILED_HOOK             0

#define configTASK_NOTIFICATION_ARRAY_ENTRIES    5

#define INCLUDE_vTaskPrioritySet                 1
#define INCLUDE_uxTaskPriorityGet                1
#define INCLUDE_vTaskDelete                      1
#define INCLUDE_vTaskCleanUpResources            0
#define INCLUDE_vTaskSuspend                     1
#define INCLUDE_vTaskDelayUntil                  1
#define INCLUDE_vTaskDelay                       1
#define INCLUDE_xTaskGetHandle                   1
#define INCLUDE_uxTaskGetStackHighWaterMark      1
#define INCLUDE_xTaskGetSchedulerState           1

#define configPRIO_BITS                          2
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY  3
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY 1
#define configLIBRARY_KERNEL_INTERRUPT_PRIORITY  3
#define configKERNEL_INTERRUPT_PRIORITY          ( configLIBRARY_KERNEL_INTERRUPT_PRIORITY << ( 8 - configPRIO_BITS ) )
#define configMAX_SYSCALL_INTERRUPT_PRIORITY     ( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << ( 8 - configPRIO_BITS ) )
#define configMAX_API_CALL_INTERRUPT_PRIORITY    configMAX_SYSCALL_INTERRUPT_PRIORITY

#define configASSERT( x )                        do { if( ( x ) == 0 ) { taskDISABLE_INTERRUPTS(); for( ;; ) { } } } while( 0 )

#endif /* FREERTOS_CONFIG_H */
